In [1]:
import pandas as pd

In [2]:
data= pd.read_csv("logisticcodedata.csv")

In [3]:
data

    age  sallary Location  sales
0    25       44    noida      0
1    25       47    noida      0
2    29       88    noida      0
3    31       86  locknow      1
4    22      100  locknow      0
5    21       32  locknow      0
6    34      100    noida      1
7    27       91    noida      0
8    32      102    noida      1
9    33      100  locknow      1
10   31      105  locknow      1
11   20       40    noida      0
12   29       92    noida      0
13   23       88  locknow      0
14   32      113    noida      1
15   21      109    noida      0
16   28       81  locknow      1
17   29       73  locknow      0
18   24      105  locknow      1

In [4]:
data= data.drop("Location",axis=1)

In [5]:
data.head()

   age  sallary  sales
0   25       44      0
1   25       47      0
2   29       88      0
3   31       86      1
4   22      100      0

In [8]:
x= data.drop("sales",axis=1)
x.head()                                   # x   is  feature

   age  sallary
0   25       44
1   25       47
2   29       88
3   31       86
4   22      100

In [9]:
y= data["sales"]
y.head()

0    0
1    0
2    0
3    1
4    0
Name: sales, dtype: int64

In [10]:
from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test = train_test_split(x, y, test_size = 1/3, random_state = 0)

In [23]:
from sklearn.svm import SVC                   # "Support vector classifier"
model = SVC(kernel='linear', C=1E10)                          #  c is for avoid hard margin  , we increase c value for avoid 
model.fit(x_train , y_train)                                  #   c is a parameter in SVM

SVC(C=10000000000.0, kernel='linear')

In [24]:
model.score(x_train , y_train)

1.0

In [25]:
model.score(x_test , y_test)

0.7142857142857143

# Model is Overfit (training result is high   and  test result is low)

In [ ]:
# very danger model